---
kind: property
id: P:Autodesk.Revit.DB.SynchronizeWithCentralOptions.Compact
source: html/23e58fe5-72f4-5d13-1003-d35f8ad3b25f.htm
---
# Autodesk.Revit.DB.SynchronizeWithCentralOptions.Compact Property

Indicates whether Revit should compact the central model while synchronizing with central.
 This option reduces the size of the central model but many increase the time it takes to perform the save.
 False by default.

## Syntax (C#)
```csharp
public bool Compact { get; set; }
```